Tekla.Structures.Drawing.Drawing.QueryUserPropertySet(System.String,Tekla.Structures.DrawingInternal.dotGrUserProperty_t@)
Sets a user property (UDA) to the drawing.
Name: The property's name.
Property: The property.
Returns: True on success.

Tekla.Structures.Drawing.Drawing.QueryUserPropertyGet(System.String,Tekla.Structures.DrawingInternal.dotGrUserProperty_t@)
Gets a user property (UDA) from the drawing.
Name: The property's name.
Property: The property.
Returns: True on success.

Tekla.Structures.Drawing.Drawing.CommitChanges
Commits the changes made to the model database so far.
Commit inserts a kind of save-point into the database and the save-point will be retrieved if the user does undo.
Commit also executes all messages.
Returns: True on success.